In [1]:
import pandas as pd

In [19]:
tempo_df = pd.read_csv("./data/20181024_d1_0830_0900.csv")
tempo_df.head()

  track_id; type; traveled_d; avg_speed; lat; lon; speed; lon_acc; lat_acc; time
0  1; Car; 48.85; 9.770344; 37.977391; 23.737688;...
1  2; Motorcycle; 98.09; 19.839417; 37.977642; 23...
2  3; Motorcycle; 63.80; 18.228752; 37.977997; 23...
3  4; Motorcycle; 145.72; 26.229014; 37.978135; 2...
4  5; Motorcycle; 138.01; 24.841425; 37.978134; 2...

In [9]:
df = pd.read_csv("./data/20181024_d1_0830_0900.csv", skiprows=1,
        header=None)

In [10]:
df.head()

                                                   0
0  1; Car; 48.85; 9.770344; 37.977391; 23.737688;...
1  2; Motorcycle; 98.09; 19.839417; 37.977642; 23...
2  3; Motorcycle; 63.80; 18.228752; 37.977997; 23...
3  4; Motorcycle; 145.72; 26.229014; 37.978135; 2...
4  5; Motorcycle; 138.01; 24.841425; 37.978134; 2...

In [11]:
series = df[0].str.split(";")

In [13]:
def split_into_chunks(arr, n):
    return [arr[i : i + n] for i in range(0, len(arr), n)]

In [14]:
pd_lines = []

for line in series:
    old_line = [item.strip() for item in line]
    info_index = 4
    info = old_line[:info_index]
    remaining = old_line[info_index:-1]
    chunks = split_into_chunks(remaining, 6)
    for chunk in chunks:
        record = info + chunk
        new_line = ",".join(record)
        pd_lines.append(record)

In [15]:
new_df = pd.DataFrame(
        pd_lines,
        columns=[
            "track_id",
            "type",
            "traveled_d",
            "avg_speed",
            "lat",
            "lon",
            "speed",
            "lon_acc",
            "lat_acc",
            "time",
        ],
    )

In [16]:
new_df.head()

,track_id,type,traveled_d,avg_speed,lat,lon,speed,lon_acc,lat_acc,time
0,1,Car,48.85,9.770344,37.977391,23.737688,4.9178,0.0518,-0.0299,0.000000
1,1,Car,48.85,9.770344,37.977391,23.737688,4.9207,-0.0124,-0.0354,0.040000
2,1,Car,48.85,9.770344,37.977391,23.737688,4.9160,-0.0519,-0.0413,0.080000
3,1,Car,48.85,9.770344,37.977390,23.737688,4.9057,-0.0914,-0.0478,0.120000
4,1,Car,48.85,9.770344,37.977390,23.737689,4.8871,-0.1679,-0.0550,0.160000

In [17]:
new_df.shape

(1446887, 10)